benchmark/throughput.txt

------ ROUND 1 - Insecure publish time ------


------ 2000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.073ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms    1.07ms  25.57ms   99.51%
    Req/Sec     2.14k   188.70     5.30k    89.47%
  59998 requests in 30.00s, 5.42MB read
Requests/sec:   1999.95
Transfer/sec:    185.15KB

------ 4000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.698ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   763.87us    1.00ms  20.59ms   99.30%
    Req/Sec     4.23k   332.09     6.89k    85.14%
  119998 requests in 30.00s, 10.85MB read
Requests/sec:   3999.97
Transfer/sec:    370.31KB

------ 6000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 3.056ms, rate sampling interval: 24ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.52ms   25.40ms  85.44ms   84.40%
    Req/Sec     6.10k   339.27     6.74k    88.00%
  179500 requests in 30.00s, 16.23MB read
Requests/sec:   5983.39
Transfer/sec:    553.93KB

------ 8000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 1276.848ms, rate sampling interval: 4653ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.66s     1.25s    6.86s    58.25%
    Req/Sec     6.25k    73.40     6.33k    50.00%
  185131 requests in 30.00s, 16.74MB read
Requests/sec:   6171.10
Transfer/sec:    571.31KB

------ 10000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 1918.161ms, rate sampling interval: 6787ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.43s     2.16s   11.14s    57.40%
    Req/Sec     6.30k    22.00     6.32k    50.00%
  188537 requests in 30.00s, 17.05MB read
Requests/sec:   6284.57
Transfer/sec:    581.81KB

------ 12000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 2455.261ms, rate sampling interval: 8757ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.72s     2.86s   14.66s    57.20%
    Req/Sec     6.12k    64.00     6.19k    50.00%
  184006 requests in 30.00s, 16.64MB read
Requests/sec:   6133.58
Transfer/sec:    567.84KB

------ 14000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 2873.305ms, rate sampling interval: 10141ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.19s     3.23s   16.69s    57.36%
    Req/Sec     6.21k     0.00     6.20k     0.00%
  186296 requests in 30.00s, 16.84MB read
Requests/sec:   6209.92
Transfer/sec:    574.90KB

------ 16000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 3101.997ms, rate sampling interval: 11116ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.31s     3.56s   18.40s    57.63%
    Req/Sec     6.08k     0.00     6.08k     0.00%
  185431 requests in 30.00s, 16.76MB read
Requests/sec:   6181.11
Transfer/sec:    572.24KB

------ ROUND 2 - Insecure query time ------


------ 2000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.986ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.97ms  464.72us   2.08ms   61.34%
    Req/Sec     2.09k   136.23     2.56k    77.71%
  59999 requests in 30.00s, 39.86MB read
Requests/sec:   1999.97
Transfer/sec:      1.33MB

------ 4000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.061ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  537.45us   2.59ms   59.53%
    Req/Sec     4.24k   284.58     5.33k    70.68%
  119996 requests in 30.00s, 79.73MB read
Requests/sec:   3999.88
Transfer/sec:      2.66MB

------ 6000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.829ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.89ms  504.97us   2.20ms   62.68%
    Req/Sec     6.32k   545.50     7.78k    64.84%
  179987 requests in 30.00s, 119.60MB read
Requests/sec:   5999.57
Transfer/sec:      3.99MB

------ 8000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.615ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   609.36us  309.34us   1.53ms   58.21%
    Req/Sec     8.44k   531.79     9.67k    62.02%
  239995 requests in 30.00s, 159.47MB read
Requests/sec:   7999.86
Transfer/sec:      5.32MB

------ 10000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.990ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   613.71us  311.07us   1.80ms   58.10%
    Req/Sec    10.56k   742.86    12.22k    57.22%
  299989 requests in 30.00s, 199.34MB read
Requests/sec:   9999.75
Transfer/sec:      6.64MB

------ 12000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.702ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   613.12us  309.39us   1.73ms   58.48%
    Req/Sec    12.67k   849.89    15.00k    62.68%
  359997 requests in 30.00s, 239.22MB read
Requests/sec:  11999.55
Transfer/sec:      7.97MB

------ 14000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 202.327ms, rate sampling interval: 689ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   832.22ms  217.56ms   1.07s    73.47%
    Req/Sec    13.54k   300.76    14.05k    48.28%
  405062 requests in 30.00s, 269.16MB read
Requests/sec:  13502.12
Transfer/sec:      8.97MB

------ 16000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 894.624ms, rate sampling interval: 3252ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.48s   916.94ms   5.14s    59.99%
    Req/Sec    13.36k   257.94    13.78k    66.67%
  397781 requests in 30.00s, 264.32MB read
Requests/sec:  13259.41
Transfer/sec:      8.81MB

------ ROUND 3 - Secure publish time ------


------ 2000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.204ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.18ms    1.06ms  21.30ms   99.38%
    Req/Sec     2.10k   208.94     5.11k    88.30%
  59997 requests in 30.00s, 5.42MB read
Requests/sec:   1999.90
Transfer/sec:    185.15KB

------ 4000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.854ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   849.10us    1.38ms  20.54ms   98.82%
    Req/Sec     4.22k   376.10     6.11k    78.69%
  119998 requests in 30.00s, 10.85MB read
Requests/sec:   3999.96
Transfer/sec:    370.31KB

------ 6000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 483.056ms, rate sampling interval: 1571ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.79s   523.93ms   2.81s    59.36%
    Req/Sec     5.43k   163.80     5.72k    66.67%
  163158 requests in 30.00s, 14.75MB read
Requests/sec:   5438.65
Transfer/sec:    503.50KB

------ 8000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 1617.466ms, rate sampling interval: 5746ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.31s     1.83s    9.49s    57.84%
    Req/Sec     5.48k    50.91     5.55k    66.67%
  163986 requests in 30.00s, 14.83MB read
Requests/sec:   5466.20
Transfer/sec:    506.05KB

------ 10000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 2294.320ms, rate sampling interval: 8163ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.02s     2.59s   13.49s    58.23%
    Req/Sec     5.50k    58.00     5.56k    50.00%
  165035 requests in 30.00s, 14.92MB read
Requests/sec:   5501.22
Transfer/sec:    509.29KB

------ 12000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 2672.867ms, rate sampling interval: 9756ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.90s     3.14s   16.33s    57.30%
    Req/Sec     5.48k    10.00     5.49k    50.00%
  164048 requests in 30.00s, 14.83MB read
Requests/sec:   5468.30
Transfer/sec:    506.25KB

------ 14000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 3058.923ms, rate sampling interval: 10960ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.20s     3.50s   18.28s    57.86%
    Req/Sec     5.49k     0.00     5.48k     0.00%
  163789 requests in 30.00s, 14.81MB read
Requests/sec:   5459.70
Transfer/sec:    505.45KB

------ 16000 req/sec------
Running 30s test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 3233.352ms, rate sampling interval: 11665ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.23s     3.86s   19.79s    57.59%
    Req/Sec     5.32k     0.00     5.32k     0.00%
  163294 requests in 30.00s, 14.76MB read
Requests/sec:   5443.19
Transfer/sec:    503.92KB

------ ROUND 4 - Secure query time ------


------ 2000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.995ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms    6.32ms  67.65ms   98.25%
    Req/Sec     2.13k   269.55     9.30k    94.49%
  59997 requests in 30.00s, 39.87MB read
Requests/sec:   1999.92
Transfer/sec:      1.33MB

------ 4000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.068ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.99ms  479.18us   2.20ms   62.33%
    Req/Sec     4.22k   321.66     5.00k    64.53%
  119995 requests in 30.00s, 79.74MB read
Requests/sec:   3999.88
Transfer/sec:      2.66MB

------ 6000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.648ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   646.25us  315.59us   1.71ms   57.89%
    Req/Sec     6.37k   404.00     7.33k    65.58%
  179996 requests in 30.00s, 119.61MB read
Requests/sec:   5999.90
Transfer/sec:      3.99MB

------ 8000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.640ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   657.51us  316.08us   1.66ms   58.42%
    Req/Sec     8.44k   584.19     9.67k    62.08%
  239991 requests in 30.00s, 159.48MB read
Requests/sec:   7999.75
Transfer/sec:      5.32MB

------ 10000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 11.946ms, rate sampling interval: 95ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   204.25ms  152.33ms 418.05ms   46.91%
    Req/Sec     9.90k   340.87    10.63k    64.76%
  296226 requests in 30.00s, 196.85MB read
Requests/sec:   9874.18
Transfer/sec:      6.56MB

------ 12000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 905.254ms, rate sampling interval: 3295ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.58s   901.36ms   5.07s    60.06%
    Req/Sec    10.08k   267.88    10.49k    50.00%
  299164 requests in 30.00s, 198.80MB read
Requests/sec:   9972.15
Transfer/sec:      6.63MB

------ 14000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 1612.032ms, rate sampling interval: 5541ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.09s     1.72s    8.86s    57.20%
    Req/Sec     9.85k   360.70    10.33k    33.33%
  295942 requests in 30.00s, 196.66MB read
Requests/sec:   9864.85
Transfer/sec:      6.56MB

------ 16000 req/sec------
Running 30s test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 2105.908ms, rate sampling interval: 7385ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.70s     2.15s   11.52s    58.98%
    Req/Sec    10.11k    64.00    10.17k    50.00%
  295596 requests in 30.00s, 196.43MB read
Requests/sec:   9853.31
Transfer/sec:      6.55MB